Revit 2027 API
ConstraintToRebarEdgeProperties.UsePositiveDirectionForZeroOffset Property
 If true, when offset is zero, the child bar is placed in the default positive direction to avoid the clash, false otherwise. The default value is true.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UsePositiveDirectionForZeroOffset { get; set; }
Public Property UsePositiveDirectionForZeroOffset As Boolean
	Get
	Set
public:
property bool UsePositiveDirectionForZeroOffset {
	bool get ();
	void set (bool value);
}
member UsePositiveDirectionForZeroOffset : bool with get, set
Property Value
Boolean
See Also
Reference
ConstraintToRebarEdgeProperties Class
Autodesk.Revit.DB.Structure Namespace